# Реализуйте алгоритм перемешивания списка
list_len = int(input('введите длину списка: '))
my_list = []
for q in range(list_len):
    my_list.append(input('Введите элемент списка: '))
    print(my_list)
    